<template>
    <div id="Home">
      <div class="container">
        <div class="descr">
          <b-row>
            <b-col cols="7">
              <p class="name">
                Игнатова Анна
              </p>
              Junior <br> Frontend-разработчик
            </b-col>
            <b-col>
              <img src="../static/6.jpg">
            </b-col>
          </b-row>

        </div>
        <b-button>
          <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
               width="25" height="25"
               viewBox="0 0 172 172"
               style=" fill:#000000;"><g fill="none" fill-rule="nonzero" stroke="none" stroke-width="1" stroke-linecap="butt" stroke-linejoin="miter" stroke-miterlimit="10" stroke-dasharray="" stroke-dashoffset="0" font-family="none" font-weight="none" font-size="none" text-anchor="none" style="mix-blend-mode: normal"><path d="M0,172v-172h172v172z" fill="none"></path><g fill="#ffffff"><path d="M34.37313,44.72c-0.44681,0.00712 -0.87331,0.18785 -1.18922,0.50391l-13.76,13.76c-0.67143,0.67171 -0.67143,1.76048 0,2.43219l65.36,65.36c0.67171,0.67143 1.76048,0.67143 2.43219,0l65.36,-65.36c0.67143,-0.67171 0.67143,-1.76048 0,-2.43219l-13.76,-13.76c-0.67171,-0.67143 -1.76048,-0.67143 -2.43219,0l-50.38391,50.38391l-50.38391,-50.38391c-0.32908,-0.32923 -0.77753,-0.51103 -1.24297,-0.50391zM34.4,48.87219l50.38391,50.38391c0.67171,0.67143 1.76048,0.67143 2.43219,0l50.38391,-50.38391l11.32781,11.32781l-62.92781,62.92781l-62.92781,-62.92781zM35.24992,64.48992c-0.3504,0.00007 -0.66573,0.21271 -0.79714,0.53754c-0.13141,0.32483 -0.05262,0.6969 0.19917,0.94059l28.38,28.38c0.21571,0.22464 0.536,0.31512 0.83737,0.23655c0.30136,-0.07857 0.53671,-0.31392 0.61528,-0.61528c0.07857,-0.30136 -0.01191,-0.62166 -0.23655,-0.83737l-28.38,-28.38c-0.16204,-0.16747 -0.38509,-0.26203 -0.61812,-0.26203zM136.7232,64.49328c-0.22319,0.00621 -0.43521,0.09897 -0.59125,0.25867l-41.28,41.28c-0.22464,0.21571 -0.31512,0.536 -0.23655,0.83737c0.07857,0.30136 0.31392,0.53671 0.61528,0.61528c0.30136,0.07857 0.62166,-0.01191 0.83737,-0.23655l41.28,-41.28c0.25309,-0.24743 0.32875,-0.62464 0.19067,-0.95054c-0.13808,-0.3259 -0.46171,-0.53393 -0.81552,-0.52423zM73.08992,102.32992c-0.3504,0.00007 -0.66573,0.21271 -0.79714,0.53754c-0.13141,0.32483 -0.05262,0.6969 0.19917,0.94059l6.02,6.02c0.21571,0.22464 0.536,0.31512 0.83737,0.23655c0.30136,-0.07857 0.53671,-0.31392 0.61528,-0.61528c0.07857,-0.30136 -0.01191,-0.62166 -0.23655,-0.83737l-6.02,-6.02c-0.16204,-0.16747 -0.38509,-0.26203 -0.61812,-0.26203zM83.40992,112.64992c-0.3504,0.00007 -0.66573,0.21271 -0.79714,0.53754c-0.13141,0.32483 -0.05262,0.6969 0.19917,0.94059l2.58,2.58c0.21571,0.22464 0.536,0.31512 0.83737,0.23655c0.30136,-0.07857 0.53671,-0.31392 0.61528,-0.61528c0.07857,-0.30136 -0.01191,-0.62166 -0.23655,-0.83737l-2.58,-2.58c-0.16204,-0.16747 -0.38509,-0.26203 -0.61813,-0.26203z"></path></g></g></svg>
        </b-button>
      </div>
    </div>
</template>

<script>
    export default {
        name: "home"
    }
</script>

<style scoped>
  #Home{
    background: url("../static/background.jpg") 100% 100% no-repeat;
    background-size: 100% 100%;
    height: 100vh;
  }
  img{
    border-radius: 100%;
    width: 100%;
    filter: contrast(110%);
    border: 5px solid white;
  }
  .descr{
    color: white;
    text-shadow: 1px 1px 2px rgba(0, 0, 0, 0.99);
    margin-top: 15%;
    height: 50%;
    width: 100%;
    font-size: 45px !important;
  }
  .name{
    font-size: 60px !important;
    font-weight: 800 !important;
  }
  .col-7{
    padding: 8% 0 0 0 !important;
  }
  button{
    margin-top: 18%;
    border: 2px solid white;
    width: 55px;
    height: 55px;
    border-radius: 50%;
    display: block;
    margin-left: auto;
    margin-right: auto;
  }
  .btn {
    background: transparent !important;
  }
  .row{
    margin-top: 0 !important;
  }
</style>
